/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

功能：求二分之一的圆面积，函数通过形参得到圆的半径，函数
      返回二分之一的圆面积。
例如：输入圆的半径值：19.527 输出为：s = 598.950017。

------------------------------------------------------*/

#include <stdio.h>
#include <conio.h>

/**********FOUND**********/
float fun( float r)
{
  float s;
  /**********FOUND**********/
  s=((float)1/2)*3.14159* r * r;
  /**********FOUND**********/
  return s;
}

main()
{
  float x;
  
  printf ( "Enter x: ");
  scanf ( "%f", &x );
  printf (" s = %f\n ", fun ( x ) );
  
}
