/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

主函数main()调用函数change()将二维数组strrow中的字符按列
存入一维数组strcol中。
------------------------------------------------------*/
#include <stdio.h>
#include <conio.h>
/**************FOUND******************/
void change(char t[][5],char s[]){
        int i,j;
        for(j=0;j<5;j++)
                for(i=0;i<3;i++)
/**************FOUND******************/
                        s[3*j+i]=t[i][j];
/**************FOUND******************/
        s[3*j+i-3]='\0';/*标准答案s[3*j]=0*/
}

int main(){
        char strrow[][5]={{'C','r','r',' ','s'},{' ','o','a','T','t'},{'P','g','m','e','!'}};
        char strcol[16];
        change(strrow,strcol);
        puts(strcol);
        getch();
        return 0;
}
