/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：已定义一个含有30个元素的数组s,函数fun1的功能是按
      顺序分别赋予各元素从2开始的偶数,函数fun2则按顺序
      每五个元素求一个平均值, 并将该值存放在数组w中。

-------------------------------------------------------*/
float s[30],w[6];
fun1(float s[])
{
  int k,i;
  for(k=2,i=0;i<30;i++)
  {
     /***********SPACE***********/
     s[i]=k;
     k+=2;
  }
}
fun2(float s[],float w[])
{
  float sum=0.0;
  int k,i;
  for(k=0,i=0;i<30;i++)
  {
     sum+=s[i];
     /***********SPACE***********/
    if((i+1)%5==0)
     { 
        w[k]=sum/5;
        /***********SPACE***********/
        sum=0;
        k++;
     }
  }
}
main()
{
   int i;
   fun1(s);
   /***********SPACE***********/
   fun2(s,w);
   for(i=0;i<30;i++)
   {
     if(i%5==0) printf("\n");
       printf("%8.2f",s[i]);
   }
   printf("\n");
   for(i=0;i<6;i++)
   printf("%8.2f",w[i]);
}


